; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_7)

(:domain logistics)

(:objects
	obj0 obj4 obj8 - airport
	obj1 obj5 obj9 - city
	obj2 obj10 obj12 obj13 obj14 obj15 obj17 - package
	obj3 obj6 obj11 - truck
	obj7 - location
	obj16 - airplane
)

(:init
	(at obj2 obj0)
	(at obj3 obj0)
	(at obj6 obj4)
	(at obj10 obj8)
	(at obj11 obj8)
	(at obj12 obj7)
	(at obj13 obj8)
	(at obj14 obj4)
	(at obj15 obj0)
	(at obj16 obj8)
	(at obj17 obj4)
	(in-city obj0 obj1)
	(in-city obj4 obj5)
	(in-city obj7 obj1)
	(in-city obj8 obj9)
)

(:goal (and
	(at obj2 obj7)
	(at obj10 obj7)
	(at obj12 obj0)
	(at obj13 obj4)
	(at obj15 obj8)
	(at obj17 obj8)
))
)

; plan
1. (load obj16 obj10 obj8)
   deleted: (at obj10 obj8)
   added: (in obj10 obj16)
   goals met: 0 of 6
2. (load obj16 obj13 obj8)
   deleted: (at obj13 obj8)
   added: (in obj13 obj16)
   goals met: 0 of 6
3. (load obj3 obj2 obj0)
   deleted: (at obj2 obj0)
   added: (in obj2 obj3)
   goals met: 0 of 6
4. (load obj6 obj14 obj4)
   deleted: (at obj14 obj4)
   added: (in obj14 obj6)
   goals met: 0 of 6
5. (load obj6 obj17 obj4)
   deleted: (at obj17 obj4)
   added: (in obj17 obj6)
   goals met: 0 of 6
6. (drive obj3 obj0 obj7)
   deleted: (at obj3 obj0)
   added: (at obj3 obj7)
   goals met: 0 of 6
7. (fly obj16 obj8 obj0)
   deleted: (at obj16 obj8)
   added: (at obj16 obj0)
   goals met: 0 of 6
8. (load obj16 obj15 obj0)
   deleted: (at obj15 obj0)
   added: (in obj15 obj16)
   goals met: 0 of 6
9. (unload obj16 obj10 obj0)
   deleted: (in obj10 obj16)
   added: (at obj10 obj0)
   goals met: 0 of 6
10. (unload obj3 obj2 obj7)
   deleted: (in obj2 obj3)
   added: (at obj2 obj7)
   goals met: 1 of 6
11. (unload obj6 obj17 obj4)
   deleted: (in obj17 obj6)
   added: (at obj17 obj4)
   goals met: 1 of 6
12. (drive obj3 obj7 obj0)
   deleted: (at obj3 obj7)
   added: (at obj3 obj0)
   goals met: 1 of 6
13. (fly obj16 obj0 obj4)
   deleted: (at obj16 obj0)
   added: (at obj16 obj4)
   goals met: 1 of 6
14. (load obj16 obj17 obj4)
   deleted: (at obj17 obj4)
   added: (in obj17 obj16)
   goals met: 1 of 6
15. (load obj3 obj10 obj0)
   deleted: (at obj10 obj0)
   added: (in obj10 obj3)
   goals met: 1 of 6
16. (drive obj3 obj0 obj7)
   deleted: (at obj3 obj0)
   added: (at obj3 obj7)
   goals met: 1 of 6
17. (fly obj16 obj4 obj8)
   deleted: (at obj16 obj4)
   added: (at obj16 obj8)
   goals met: 1 of 6
18. (load obj3 obj12 obj7)
   deleted: (at obj12 obj7)
   added: (in obj12 obj3)
   goals met: 1 of 6
19. (unload obj16 obj15 obj8)
   deleted: (in obj15 obj16)
   added: (at obj15 obj8)
   goals met: 2 of 6
20. (unload obj16 obj17 obj8)
   deleted: (in obj17 obj16)
   added: (at obj17 obj8)
   goals met: 3 of 6
21. (unload obj3 obj10 obj7)
   deleted: (in obj10 obj3)
   added: (at obj10 obj7)
   goals met: 4 of 6
22. (drive obj3 obj7 obj0)
   deleted: (at obj3 obj7)
   added: (at obj3 obj0)
   goals met: 4 of 6
23. (fly obj16 obj8 obj4)
   deleted: (at obj16 obj8)
   added: (at obj16 obj4)
   goals met: 4 of 6
24. (unload obj16 obj13 obj4)
   deleted: (in obj13 obj16)
   added: (at obj13 obj4)
   goals met: 5 of 6
25. (unload obj3 obj12 obj0)
   deleted: (in obj12 obj3)
   added: (at obj12 obj0)
   goals met: 6 of 6
